---
kind: other
id: Methods.T:Autodesk.Revit.DB.Reference
source: html/aa17761b-c9e4-b3f5-3a72-05550e4bcc57.htm
---
# Reference Methods

Checks if given reference identifies part of object identified by this reference.